nxp-mcuxpresso/mcuxsdk-examples/_boards/rdrw612bga/littlefs_examples/littlefs_shell/pin_mux.h
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name GPIO_24 (coord E5), J6[1]/J11[3]/HD2[13]/FC3_UART_RXD_ML
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITPINS_UART_RXD_PERIPHERAL FLEXCOMM3
/*!
 * @brief Signal name */
#define BOARD_INITPINS_UART_RXD_SIGNAL USART_RXD
/*!
 * @brief GPIO pin number */
#define BOARD_INITPINS_UART_RXD_GPIO_PIN 24U
/*!
 * @brief PORT number */
#define BOARD_INITPINS_UART_RXD_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITPINS_UART_RXD_PIN 24U
/*!
 * @brief PORT pin mask */
#define BOARD_INITPINS_UART_RXD_PIN_MASK (1U << 24U)
/* @} */

/*!
 * @brief 
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
